tap "akitasoftware/akita"
tap "aspect-build/aspect"
tap "bufbuild/buf"
tap "buildpacks/tap"
tap "cloudquery/tap"
tap "coursier/formulas"
tap "datawire/blackbird"
tap "daveshanley/vacuum"
tap "earthly/earthly"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "int128/kubelogin"
tap "localstack/tap"
tap "oven-sh/bun"
tap "soluble-ai/kubetap"
tap "thought-machine/please"
tap "withgraphite/tap"
# CLI tool for working with Architecture Decision Records
brew "adr-tools"
# Image format providing lossless and lossy compression for web images
brew "webp"
# New file format for still image compression
brew "jpeg-xl"
# Alternative to backtracking PCRE-style regular expression engines
brew "re2"
# Next generation open source RPC library and framework
brew "grpc"
# Columnar in-memory analytics layer designed to accelerate big data
brew "apache-arrow"
# Build OCI images from APK packages directly without Dockerfile
brew "apko"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Download with resuming and segmented downloading
brew "aria2"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Shell extension to jump to frequently used directories
brew "autojump"
# Platform built on V8 to build network applications
brew "node"
# AWS Cloud Development Kit - framework for defining AWS infra as code
brew "aws-cdk"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Text processing system for reStructuredText
brew "docutils"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# User-friendly launcher for Bazel
brew "bazelisk", link: false
# Collection of portable C++ source libraries
brew "boost"
# Manage compile and link flags for libraries
brew "pkg-config"
# Computational Geometry Algorithms Library
brew "cgal"
# Cross-platform make
brew "cmake"
# Package acting as bridge between Node projects and their package managers
brew "corepack", link: false
# Development kit for the Java programming language
brew "openjdk"
# Pure Scala Artifact Fetching
brew "coursier"
# Tool for interacting with remote images and registries
brew "crane"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Debian package management system
brew "dpkg"
# Collection of reusable C++ library artifacts developed at Facebook
brew "folly"
# Shared library for Watchman and Eden projects
brew "edencommon"
# Cross-platform C++ GUI toolkit
brew "wxwidgets"
# Programming language for highly scalable real-time systems
brew "erlang"
# Functional metaprogramming aware language built on Erlang VM
brew "elixir"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Fast partial replacement for the codemod tool
brew "fastmod"
# C++14 implementation of the TLS-1.3 standard
brew "fizz"
# Modular, composable client/server abstractions framework
brew "wangle"
# Facebook's branch of Apache Thrift, including a new C++ server
brew "fbthrift"
# Thrift functions for querying information from a service
brew "fb303"
# Command-line tools for fly.io services
brew "flyctl"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# Graphics library to dynamically manipulate images
brew "gd"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Library access to GnuPG
brew "gpgme"
# File format designed to store large amounts of data
brew "hdf5"
# Cartographic Projections Library
brew "proj"
# Library and tools for dealing with GeoTIFF
brew "libgeotiff"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Libraries and data formats for array-oriented scientific data
brew "netcdf"
# Package for scientific computing with Python
brew "numpy"
# Library for JPEG-2000 image manipulation
brew "openjpeg"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Geospatial Data Abstraction Library
brew "gdal"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Git extension for versioning large files
brew "git-lfs"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Fast linters runner for Go
brew "golangci-lint"
# Reformats Java source code to comply with Google Java Style
brew "google-java-format"
# Deliver Go binaries as fast and easily as possible
brew "goreleaser"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Image processing tools collection
brew "graphicsmagick"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Post-modern modal text editor
brew "helix"
# Kubernetes package manager
brew "helm"
# Convert source code to formatted text with syntax highlighting
brew "highlight"
# Configurable static site generator
brew "hugo"
# Library for reading RAW files from digital photo cameras
brew "libraw"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Statically typed programming language for the JVM
brew "kotlin"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Kubernetes command-line interface
brew "kubernetes-cli@1.22"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# Conversion library
brew "libiconv"
# C implementation of a Sass compiler
brew "libsass"
# Utility for directing compilation
brew "make"
# Java-based project management
brew "maven"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# MongoDB Shell to connect, configure, query, and work with your MongoDB database
brew "mongosh"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# Open source relational database management system
brew "mysql-client"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Tiny, lightning fast, feature-packed file manager
brew "nnn"
# JavaScript implementation of a Sass compiler
brew "node-sass"
# Platform built on V8 to build network applications
brew "node@18"
# Okta federated identity for AWS CLI
brew "okta-aws-cli"
# Generate clients, server & docs from an OpenAPI spec (v2, v3)
brew "openapi-generator"
# Development kit for the Java programming language
brew "openjdk@17"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Perl compatible regular expressions library
brew "pcre"
# Fast, disk space efficient package manager
brew "pnpm"
# Generic machine emulator and virtualizer
brew "qemu"
# Tool for managing OCI containers and pods
brew "podman"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Cross-platform application and UI framework
brew "qt@5"
# Generate types and converters from JSON, Schema, and GraphQL
brew "quicktype"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# CLI for managing and maintaining data graphs with Apollo Studio
brew "rover"
# Powerful, clean, object-oriented scripting language
brew "ruby", link: true
# Collection of tools for managing UNIX services
brew "runit"
# Rust toolchain installer
brew "rustup-init"
# Login and retrieve AWS temporary credentials using a SAML IDP
brew "saml2aws"
# Source control client
brew "sapling"
# Used as a compiler wrapper and avoids compilation when possible
brew "sccache"
# Testing tool for web applications with specs
brew "schemathesis"
# C++ wrapper library around CGAL
brew "sfcgal"
# SOcket CAT: netcat on steroids
brew "socat"
# User interface to the TELNET protocol
brew "telnet"
# Thin wrapper for Terraform e.g. for locking state
brew "terragrunt"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Syntax-aware linter for prose
brew "vale"
# Secures, stores, and tightly controls access to secrets
brew "vault"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Watch files and take action when they change
brew "watchman"
# Fast CSV toolkit written in Rust
brew "xsv"
# Linter for YAML files
brew "yamllint"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# The Akita CLI
brew "akitasoftware/akita/akita-cli"
# Correct, fast, usable: choose three
brew "aspect-build/aspect/aspect"
# The best way of working with Protocol Buffers.
brew "bufbuild/buf/buf"
# A CLI for building apps using Cloud Native Buildpacks
brew "buildpacks/tap/pack"
# Easily monitor and ask questions about your infrastructure.
brew "cloudquery/tap/cloudquery"
# Local dev environment attached to a remote Kubernetes cluster
brew "datawire/blackbird/telepresence"
# The worlds fastest and most scalable OpenAPI linter
brew "daveshanley/vacuum/vacuum"
# Build automation tool for the container era
brew "earthly/earthly/earthly"
# Terraform
brew "hashicorp/tap/terraform"
# A kubectl plugin for Kubernetes OpenID Connect authentication
brew "int128/kubelogin/kubelogin"
# Localstack cli packaged using pyinstaller
brew "localstack/tap/localstack-cli"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# Command-line interface for 1Password
cask "1password-cli"
# Automated testing of webapps for Google Chrome
cask "chromedriver"
# GraalVM from Oracle
cask "graalvm-jdk"
# Rust-based terminal
cask "warp"
vscode "42crunch.vscode-openapi"
vscode "4ops.terraform"
vscode "arcanis.vscode-zipfs"
vscode "bierner.markdown-mermaid"
vscode "bufbuild.vscode-buf"
vscode "christian-kohler.npm-intellisense"
vscode "davidbwaters.macos-modern-theme"
vscode "dgileadi.java-decompiler"
vscode "dsznajder.es7-react-js-snippets"
vscode "earthly.earthfile-syntax-highlighting"
vscode "gamunu.vscode-yarn"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "jakebecker.elixir-ls"
vscode "jordanhury.sqltools-cassandra"
vscode "microsoft.typespec-vscode"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.vscode-typescript-next"
vscode "msaraiva.surface"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-mysql"
vscode "mtxr.sqltools-driver-pg"
vscode "mtxr.sqltools-driver-sqlite"
vscode "mushan.vscode-paste-image"
vscode "pantajoe.vscode-elixir-credo"
vscode "prisma.prisma"
vscode "quicktype.quicktype"
vscode "redhat.java"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "sourcegraph.cody-ai"
vscode "tamasfe.even-better-toml"
vscode "theaflowers.witch-hazel"
vscode "unifiedjs.vscode-mdx"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
vscode "vue.volar"
vscode "zxh404.vscode-proto3"
