tap "eddieantonio/eddieantonio"
tap "zoidbergwill/python"
tap "homebrew/dupes"
tap "homebrew/completions"
tap "homebrew/apache"
tap "homebrew/science"
tap "homebrew/core"
tap "homebrew/php"
tap "homebrew/versions"
tap "homebrew/boneyard"
tap "homebrew/gui"
tap "homebrew/python"
tap "homebrew/bundle"
tap "homebrew/services"
tap "rstacruz/backup"
tap "hhvm/hhvm"
tap "go-delve/delve"
tap "caskroom/fonts"
tap "caskroom/versions"
tap "caskroom/cask"
tap "grammarly/tap"
tap "ethereum/ethereum"
tap "ksonnet/tap"
cask "java"
cask "xquartz"
brew "ack"
brew "apr-util"
brew "aria2"
brew "xz"
brew "asciinema"
brew "aspell"
brew "fontconfig"
brew "gettext"
brew "libffi"
brew "pkg-config"
brew "libsigc++"
brew "glibmm"
brew "atkmm"
brew "autoconf"
brew "autojump"
brew "automake"
brew "bash"
brew "binutils"
brew "bison@2.7"
brew "boost@1.60"
brew "brotli"
brew "cairomm"
brew "certbot"
brew "cmake"
brew "cscope"
brew "curl", args: ["with-openssl"]
brew "darcs"
brew "diff-so-fancy"
brew "libgpg-error"
brew "libassuan"
brew "libgcrypt"
brew "libksba"
brew "pth"
brew "dirmngr"
brew "docbook"
brew "docker", link: false
brew "libyaml"
brew "docker-compose", link: false
brew "libev"
brew "docker-machine-driver-xhyve"
brew "elixir"
brew "exa"
brew "exercism"
brew "fasd"
brew "figlet"
brew "flatbuffers"
brew "flex"
brew "fortune"
brew "fpp"
brew "fzy"
brew "gawk"
brew "isl"
brew "gcc"
brew "gcc@5"
brew "gd"
brew "gdk-pixbuf"
brew "gflags"
brew "gibo"
brew "git"
brew "git-lfs"
brew "glog"
brew "libxml2"
brew "gnome-doc-utils"
brew "gnu-sed"
brew "gnu-tar"
brew "libunistring"
brew "nettle"
brew "gnutls"
brew "google-protobuf"
brew "googler"
brew "gpm"
brew "libtool"
brew "graphicsmagick"
brew "graphviz"
brew "protobuf"
brew "grpc"
brew "gsasl"
brew "gsettings-desktop-schemas"
brew "icu4c"
brew "gtk+"
brew "libepoxy"
brew "gtk+3"
brew "pangomm"
brew "gtkmm3"
brew "gtksourceview3"
brew "gzip"
brew "highlight"
brew "hostess"
brew "httpie"
brew "hub"
brew "hugo"
brew "iftop"
brew "imagemagick"
brew "intltool"
brew "iproute2mac"
brew "jemalloc"
brew "jpegoptim"
brew "oniguruma"
brew "jq"
brew "jsoncpp"
brew "jsonnet"
brew "kompose"
brew "kubernetes-cli"
brew "kubernetes-helm"
brew "lftp"
brew "libcroco"
brew "libelf"
brew "libevent"
brew "libinfinity"
brew "libnet"
brew "librsvg"
brew "libssh2"
brew "libtermkey"
brew "libusb"
brew "libusb-compat"
brew "libvterm"
brew "libxml++"
brew "libzip"
brew "little-cms2"
brew "luajit"
brew "lz4"
brew "lzlib"
brew "macvim"
brew "makedepend"
brew "mas"
brew "numpy"
brew "matplotlib"
brew "maven"
brew "mhash"
brew "mcrypt"
brew "md5sha1sum"
brew "mercurial"
brew "minio"
brew "moreutils"
brew "msgpack"
brew "mtr"
brew "mysql"
brew "screenresolution"
brew "neofetch"
brew "popt"
brew "newt"
brew "ngrep"
brew "nmap"
brew "nvm"
brew "opam"
brew "openssh"
brew "openssl@1.1"
brew "ossp-uuid"
brew "osxutils"
brew "pandoc"
brew "peco"
brew "pinentry"
brew "pngcrush"
brew "pngquant"
brew "postgresql"
brew "pstree"
brew "pwgen"
brew "pyenv"
brew "pyenv-ccache"
brew "pyenv-pip-migrate"
brew "pyenv-virtualenv"
brew "pypy3"
brew "qt"
brew "rancher-cli"
brew "rancher-compose"
brew "ruby-build"
brew "rbenv"
brew "re2c"
brew "ripgrep"
brew "ruby@2.0"
brew "scons"
brew "shared-mime-info"
brew "shellcheck"
brew "snappy"
brew "ssh-copy-id"
brew "stern"
brew "swig"
brew "tbb"
brew "tcptraceroute"
brew "terraform"
brew "the_silver_searcher"
brew "thrift"
brew "tldr"
brew "unixodbc"
brew "unrar"
brew "utf8proc"
brew "watch"
brew "whois"
brew "xhyve"
brew "yarn"
brew "zlib"
brew "zplug"
brew "zsh", args: ["HEAD"]
brew "zsh-completions"
brew "go-delve/delve/delve"
brew "grammarly/tap/rocker"
brew "homebrew/php/composer"
brew "homebrew/php/php71"
brew "ksonnet/tap/ks"
cask "docker-toolbox"
cask "gpgtools"
cask "haskell-platform"
cask "hyper"
cask "keybase"
cask "macports"
cask "mono-mdk"
cask "pinta"
cask "wireshark-chmodbpf"
mas "Caffeine", id: 411246225
mas "Keynote", id: 409183694
mas "Microsoft Remote Desktop", id: 715768417
mas "Todoist", id: 585829637
mas "Xcode", id: 497799835
